/*
    sort函数的几种用法
 */

// ================================================
// 1. 对象按年龄排序
// ================================================
const users = [
    {name: "Tom", age: 18},
    {name: "Lucy", age: 22},
    {name: "Jack", age: 21}
]
users.sort((a, b) => a.age - b.age);
console.log(users);
// [
//   { name: 'Tom', age: 18 },
//   { name: 'Jack', age: 21 },
//   { name: 'Lucy', age: 22 }
// ]

// ================================================
// 1. 对象按年龄排序
// ================================================