
// ================================================
// 1. 数组映射——一一对应变换
// ================================================

const nums = [1, 2, 3];
const res = nums.map( n => n * 2);
console.log(res); //[ 2, 4, 6 ]

// ================================================
// 2. 提取对象中的某个字段
// ================================================
const users = [
    {id: 1, "name": "bob"},
    {id: 2, "name": "alanb"},
];
const userNames = users.map( u => u.name);
console.log(userNames); // [ 'bob', 'alanb' ]

// ================================================
// 3. 结构转换（后端——前端常见）
// ================================================
const data = [
    { id: 1, price: 100},
];
const result = data.map( item => ({
    value: item.id,
    label: item.price + "元",
}));
console.log(result);

// ================================================
// 4. 字符串数组处理
// ================================================
console.log(['1', '2', '3'].map(Number)); // [ 1, 2, 3 ]
// 不能写成
console.log(['1', '2', '3'].map(parseInt)); // [1, NaN, NaN]


