
/* ================================================
    reduce函数的几种用法
  ================================================ */

// ================================================
// 1. 是否存在条件的值
// ================================================
const nums = [1, 3, 5, 8];

console.log(nums.some(n => n % 2 === 0)); // true

// ================================================
// 2. 是否存在给定callback条件中【不合法】的值
// ================================================
const inputs = ['123', '45', 'abc'];
console.log(inputs.some( v => isNaN(v))); // true，存在条件判定isNaN()，即'abc'

// ================================================
// 3. 对象数组中是否有符合条件的对象
// ================================================
const users = [
    {name: "Tom", banned: false},
    {name: "Jerry", banned: true},
]

console.log(users.some(u => u.banned)); // true

// ================================================
// 4. 配合字符串/includes
// ================================================
const courses = ["js", "react", "vue"];
const title = "Learn react hooks!";

console.log(courses.some( c => title.includes(c))); // true


// ================================================
// 坑1. 不会遍历数组，一旦找到，立刻停止
// ================================================
[1, 2, 3, 4].some( n=>{
    console.log(n);
    return n > 2;
});

// 坑2. 空数组永远返回flase
console.log([].some( x => x >= 2)); // false
// 对比every
console.log([].every( x=> x >= 2)); // true